In [36]:
import numpy as np
np.linspace(2,10,5)

array([ 2.,  4.,  6.,  8., 10.])

In [26]:
np.logspace(5,10,10,base=2)

array([  32.        ,   47.03150375,   69.12382329,  101.59366733,
        149.31571707,  219.45445961,  322.53978877,  474.04785269,
        696.72448009, 1024.        ])

In [33]:
import numpy as np
import pandas as pd  
cols=["name","age","gender"]
cols
user1=pd.DataFrame([["a",11,"male"],["b",19,"male"],["c",30,"female"]],columns=cols)
user1

  name  age  gender
0    a   11    male
1    b   19    male
2    c   30  female

In [34]:
#less than 20
user1[user1.age<20]

  name  age gender
0    a   11   male
1    b   19   male